tests/fixtures/lis2/data/replace_person.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <imsx_syncRequestHeaderInfo xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.imsglobal.org/services/lis/pms2p0/wsdl11/sync/imspms_v2p0">
      <imsx_version>V1.0</imsx_version>
      <imsx_messageIdentifier>2</imsx_messageIdentifier>
    </imsx_syncRequestHeaderInfo>
  </soapenv:Header>
  <soapenv:Body>
    <replacePersonRequest xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.imsglobal.org/services/lis/pms2p0/wsdl11/sync/imspms_v2p0">
      <sourcedId>1000001</sourcedId>
      <personRecord>
        <sourcedGUID>
          <refAgentInstanceID>ILP</refAgentInstanceID>
          <sourcedId>1000001</sourcedId>
        </sourcedGUID>
        <person>
          <formname>
            <formnameType>
              <instanceIdentifier>
                <language>en</language>
                <textString>?</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/formatnmetypevocabularyv1p0</instanceVocabulary>
              <instanceValue>
                <language>en</language>
                <textString>Full</textString>
              </instanceValue>
            </formnameType>
            <formattedName>
              <language>en</language>
              <textString>Mr. Test A User Jr.</textString>
            </formattedName>
          </formname>
          <name>
            <nameType>
              <instanceIdentifier>
                <language>en</language>
                <textString>?</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/formatnmetypevocabularyv1p0</instanceVocabulary>
              <instanceValue>
                <language>en</language>
                <textString>Full</textString>
              </instanceValue>
            </nameType>
            <partName>
              <instanceIdentifier>
                <language>en</language>
                <textString>?</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/partnamevocabularyv1p0</instanceVocabulary>
              <instanceName>
                <language>en</language>
                <textString>First</textString>
              </instanceName>
              <instanceValue>
                <language>en</language>
                <textString>Test</textString>
              </instanceValue>
            </partName>
            <partName>
              <instanceIdentifier>
                <language>en</language>
                <textString>?</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/partnamevocabularyv1p0</instanceVocabulary>
              <instanceName>
                <language>en</language>
                <textString>Last</textString>
              </instanceName>
              <instanceValue>
                <language>en</language>
                <textString>User</textString>
              </instanceValue>
            </partName>
            <partName>
              <instanceIdentifier>
                <language>en</language>
                <textString>?</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/partnamevocabularyv1p0</instanceVocabulary>
              <instanceName>
                <language>en</language>
                <textString>Middle</textString>
              </instanceName>
              <instanceValue>
                <language>en</language>
                <textString>A</textString>
              </instanceValue>
            </partName>
            <partName>
              <instanceIdentifier>
                <language>en</language>
                <textString>?</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/partnamevocabularyv1p0</instanceVocabulary>
              <instanceName>
                <language>en</language>
                <textString>Prefix</textString>
              </instanceName>
              <instanceValue>
                <language>en</language>
                <textString>Mr.</textString>
              </instanceValue>
            </partName>
            <partName>
              <instanceIdentifier>
                <language>en</language>
                <textString>?</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/partnamevocabularyv1p0</instanceVocabulary>
              <instanceName>
                <language>en</language>
                <textString>Suffix</textString>
              </instanceName>
              <instanceValue>
                <language>en</language>
                <textString>Jr.</textString>
              </instanceValue>
            </partName>
            <partName>
              <instanceIdentifier>
                <language>en</language>
                <textString>?</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/partnamevocabularyv1p0</instanceVocabulary>
              <instanceName>
                <language>en</language>
                <textString>Nickname</textString>           <!-- TODO - We don't know the field that banner uses for this -->
              </instanceName>
              <instanceValue>
                <language>en</language>
                <textString>Nick</textString>
              </instanceValue>
            </partName>
            <partName>
              <instanceIdentifier>
                <language>en</language>
                <textString>?</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/partnamevocabularyv1p0</instanceVocabulary>
              <instanceName>
                <language>en</language>
                <textString>NotValid</textString>           <!-- An intentionally unknown name part. -->
              </instanceName>
              <instanceValue>
                <language>en</language>
                <textString>NotValid</textString>
              </instanceValue>
            </partName>
          </name>
          <contactinfo>
            <contactinfoType>
              <instanceIdentifier>
                <language>en</language>
                <textString>EmailPrimary</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/contactinfotypevocabularyv1p0</instanceVocabulary>
              <instanceValue>
                <language>en</language>
                <textString>EmailPrimary</textString>
              </instanceValue>
            </contactinfoType>
            <contactinfoValue>
              <language>en</language>
              <textString>testUser@eXample.com</textString>
            </contactinfoValue>
          </contactinfo>
          <roles>
            <enterpriserolesType>
              <instanceIdentifier>
                <language>en</language>
                <textString>StudentInformationSystem</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/epriserolestypevocabularyv1p0</instanceVocabulary>
              <instanceValue>
                <language>en</language>
                <textString>StudentInformationSystem</textString>
              </instanceValue>
            </enterpriserolesType>
            <institutionRole>
              <institutionroletype>
                <instanceIdentifier>
                  <language>en</language>
                  <textString>Faculty</textString>
                </instanceIdentifier>
                <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/institutionroletypevocabularyv1p0</instanceVocabulary>
                <instanceValue>
                  <language>en</language>
                  <textString>Faculty</textString>
                </instanceValue>
              </institutionroletype>
              <primaryroletype>true</primaryroletype>
            </institutionRole>
            <userId>
              <userIdValue>
                <language>en</language>
                <textString>LogonIDUserID</textString>
              </userIdValue>
              <userIdType>
                <language>en</language>
                <textString>Logon ID</textString>
              </userIdType>
              <password>
                <language>en</language>
                <textString>11111111-2222-1111-3333-111111111111</textString>
              </password>
              <authenticationType>
                <language>en</language>
                <textString>ldap</textString>
              </authenticationType>
            </userId>
            <userId>
              <userIdValue>
                <language>en</language>
                <textString>EmailUserID</textString>
              </userIdValue>
              <userIdType>
                <language>en</language>
                <textString>Email ID</textString>
              </userIdType>
              <password>
                <language>en</language>
                <textString>{SSHA}FakeSHAPassword==</textString>
              </password>
              <pwEncryptionType>
                <language>en</language>
                <textString>SSHA</textString>
              </pwEncryptionType>
              <authenticationType>
                <language>en</language>
                <textString></textString>
              </authenticationType>
            </userId>
            <userId>
              <userIdValue>
                <language>en</language>
                <textString>SCTIDUserid</textString>
              </userIdValue>
              <userIdType>
                <language>en</language>
                <textString>SCTID</textString>
              </userIdType>
            </userId>
            <userId>
              <userIdValue>
                <language>en</language>
                <textString>OtherUserID</textString>
              </userIdValue>
              <userIdType>
                <language>en</language>
                <textString>Other ID</textString>
              </userIdType>
            </userId>
            <userId>
              <userIdType>
                <language>en</language>
                <textString>Intentionally Bad ID</textString>
              </userIdType>
            </userId>
          </roles>
          <dataSource>Banner</dataSource>
          <extension>
            <extensionNameVocabulary>http://www.imsglobal.org/vdex/lis/pmsv2p0/extensionvocabularyv1p0</extensionNameVocabulary>
            <extensionTypeVocabulary>http://www.imsglobal.org/vdex/lis/pmsv2p0/extensionvocabularyv1p0</extensionTypeVocabulary>
            <extensionField>
              <fieldName>BannerID</fieldName>
              <fieldType>String</fieldType>
              <fieldValue>A00000000</fieldValue>
            </extensionField>
            <extensionField>
              <fieldName>SourcedId</fieldName>
              <fieldType>String</fieldType>
              <fieldValue>1000001</fieldValue>
            </extensionField>
          </extension>
        </person>
      </personRecord>
    </replacePersonRequest>
  </soapenv:Body>
</soapenv:Envelope>
